[
    {
        "date": "2025-04",
        "type": "start",
        "title": "Started Software Developer Role",
        "organization": "AgriGro West (contract)",
        "description": [
            "Building and maintaining an agricultural ecommerce platform, including a React-based website and Flutter mobile application integrated with a Contentful CMS.",
            "Focused on creating scalable components, improving API data handling, and enhancing cross-platform user experiences."
        ]
    },
    {
        "date": "2024-04",
        "type": "start",
        "title": "Started Web Developer Internship",
        "organization": "FamilySearch",
        "description": [
            "Contributed to the TreeWeb team at FamilySearch as a frontend developer, building responsive React components and enhancing user-facing features used by millions of genealogy researchers worldwide.",
            "Collaborated in an Agile environment, participating in code reviews, sprint planning, and cross-functional development discussions."
        ]
    },
    {
        "date": "2024-09",
        "type": "end",
        "title": "Completed Internship",
        "organization": "FamilySearch",
        "description": []
    },
    {
        "date": "2023-12",
        "type": "start",
        "title": "Started Software Developer Internship",
        "organization": "AmericaHealth",
        "description": [
            "Developed and maintained internal tools using Angular, PHP, and MySQL, streamlining data management processes for healthcare staff.",
            "Improved application performance by identifying inefficient queries and enhancing component state logic."
        ]
    },
    {
        "date": "2024-04",
        "type": "end",
        "title": "Completed Internship",
        "organization": "AmericaHealth",
        "description": []
    },
    {
        "date": "2023-02",
        "type": "start",
        "title": "Started Independent Web Dev Project",
        "organization": "Valley Music Club (volunteer)",
        "description": [
            "Led the design and development of ValleyMusicClub.com, a public-facing site for managing registration, event promotion, and payment coordination.",
            "Built the backend with PHP and MySQL, and styled the frontend with SCSS. Maintained regular communication with the client to align technical decisions with user needs."
        ]
    },
    {
        "date": "2017-09",
        "type": "milestone",
        "title": "Started Higher Education @BYU-Idaho",
        "organization": "Brigham Young University - Idaho",
        "description": [
            "Enrolled at Brigham Young University–Idaho, beginning coursework in Software Engineering and laying the foundation for a career in full-stack web development."
        ]
    },
    {
        "date": "2024-07",
        "type": "milestone",
        "title": "Graduated from BYU-Idaho",
        "organization": "Brigham Young University - Idaho",
        "description": [
            "Graduated with a Bachelor's of Science in Software Engineering and a Certificate in Full-Stack Web Development from Brigham Young University-Idaho (GPA 3.97/4.0).",
            "Completed coursework in software design, web development, databases, data structures, and Agile methodologies."
        ]
    },
    {
        "date": "2023-10",
        "type": "event",
        "title": "2nd Place in Category @Hackathon",
        "organization": "I-Hack (BYU-Idaho Hackathon)",
        "description": [
            "Awarded 2nd Place in the Media and Communication category at BYU-Idaho’s I-Hack Hackathon for developing iCarpool, a carpool coordination app.",
            "Built a lightweight, custom component framework in vanilla JavaScript to power iCarpool's UI, reducing external dependencies for faster load times."
        ]
    }
]